#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-vuNWLQPwBgoW6ccy

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.9b80161f.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.map"]: Refreshing state... [id=static/js/main.9b80161f.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js.map"]: Refreshing state... [id=static/js/915.033d04e9.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js"]: Refreshing state... [id=static/js/915.033d04e9.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js"]: Refreshing state... [id=static/js/main.9b80161f.js]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"]: Refreshing state... [id=static/js/106.66034d11.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"]: Refreshing state... [id=static/js/106.66034d11.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"]: Refreshing state... [id=static/css/main.af03688d.css.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"]: Refreshing state... [id=static/css/main.af03688d.css]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js.map"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "025bca22facdbab167f517d3463ffab7" -> "b178eb6704117e7bc1c4817fa765823e"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "p3Q_IjiTyc.wr2rLCt0CTW.yNot3gAXA" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "ada7b791b3ee6b8fea5f4f81f450e6c3" -> "bdcf0ee982c2310ec956e4c074c73953"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "5_iB7ScgpVQuPuwRnmGwLOfLo8.YDNBl" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js"] will be destroyed
  # (because key ["static/js/915.033d04e9.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "4600acec1ac4ba4401a944e83760c256" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.033d04e9.chunk.js" -> null
      - key                    = "static/js/915.033d04e9.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.033d04e9.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "C5Xw1ImWswWPdsjechjmjXyXlw1Ls3aa" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.033d04e9.chunk.js.map"] will be destroyed
  # (because key ["static/js/915.033d04e9.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "66b00350cf5f86ed825eb9ecdad3eac1" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.033d04e9.chunk.js.map" -> null
      - key                    = "static/js/915.033d04e9.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.033d04e9.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Pqg69RhQ3BkuB577hKJ7xAjAV8px32eZ" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "7cf9ac0d35524de42b3188618b1d6cdb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.8e18decd.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.8e18decd.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "6edfb93745a54808338ae2b2296ee173"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.8e18decd.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.8e18decd.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3e7d5a7f.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "21a1814f5e8a96e3d24535af23c9f8de"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3e7d5a7f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3e7d5a7f.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3e7d5a7f.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "e3f71d2c7f7fb57d48ae08488b42fd48"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3e7d5a7f.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3e7d5a7f.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.3e7d5a7f.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "0942ed80dd92a32354b7414f89b5cf1a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.3e7d5a7f.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.3e7d5a7f.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js"] will be destroyed
  # (because key ["static/js/main.9b80161f.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "96810aa06e3944f4551916a6ddb019c6" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9b80161f.js" -> null
      - key                    = "static/js/main.9b80161f.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9b80161f.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "C9QtMLGs_g0T3urB.fM.dWQD7_sYlttz" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.9b80161f.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "e3f71d2c7f7fb57d48ae08488b42fd48" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9b80161f.js.LICENSE.txt" -> null
      - key                    = "static/js/main.9b80161f.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9b80161f.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "78leYEaWkuOtwFErkDgPyoXelhEIXKqx" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9b80161f.js.map"] will be destroyed
  # (because key ["static/js/main.9b80161f.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "cd81b3d6b932ce89267ac332713e94fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9b80161f.js.map" -> null
      - key                    = "static/js/main.9b80161f.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9b80161f.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "4JkQ6S1Ef4MRkXZ50RXLy_aDzYKjlmMM" -> null
    }

Plan: 5 to add, 2 to change, 5 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*